let handler = async (m, { conn }) => {
  let who = m.quoted ? m.quoted.sender : m.mentionedJid && m.mentionedJid[0] ? m.mentionedJid[0] : m.fromMe ? conn.user.jid : m.sender
  let videoUrl = 'https://telegra.ph/file/20e7b01ed8cc14b190ff0.jpg'
  let { name } = global.db.data.users[who]
  m.react('🧑‍💻')
let str = `> *╮───[ اوامر المطور ]───✧*
> *┤ 〚 .بريم 〛*
> *┤ 〚 .خفض-بريم 〛*
> *┤ 〚 .المميزين 〛*
> *┤────────────···*
> *┤ 〚 .فحص 〛*   
> *┤ 〚 .انضم 〛* 
> *┤ 〚 .عقد_الايجار 〛* 
> *┤ 〚 .انهاء_العقد 〛* 
> *┤ 〚 .اخرج 〛*
> *┤ 〚 .الجروبات 〛* 
> *┤────────────···* 
> *┤ 〚 .ارفعني 〛*
> *┤ 〚 .هاك 〛*   
> *┤ 〚 .اسحبها 〛* 
> *┤ 〚 .نزلهم 〛* 
> *┤────────────···* 
> *┤ 〚 .بان 〛*
> *┤ 〚 .رفع-البان 〛* 
> *┤ 〚 .بانشات 〛* 
> *┤ 〚 .بانشات_فك 〛* 
> *┤ 〚 .المبندين 〛* 
> *┤ 〚 .بلوك 〛*
> *┤ 〚 .رفع-البلوك 〛*
> *┤ 〚 .البلوكات 〛*
> *┤ 〚 .حظر 〛*
> *┤ 〚 .الغاء-الحظر 〛*
> *┤ 〚 .الغاء-المنع 〛* 
> *┤ 〚 .المحظورين 〛*
> *┤────────────···* 
> *┤ 〚 .تشغيل 〛*
> *┤ 〚 .ريستارت 〛* 
> *┤ 〚 .ايقاف 〛*
> *┤ 〚 .رسترهم 〛* 
> *┤ 〚 .تحديث 〛* 
> *┤ 〚 .ريستارت 〛*
> *┤ 〚 .إعادة 〛* 
> *┤────────────···* 
> *┤ 〚 .تنظيف 〛* 
> *┤ 〚 .تنظيف2 〛* 
> *┤────────────···* 
> *┤ 〚 .ضيف_اكسبي 〛* 
> *┤ 〚 .ضيف_جواهر 〛*
> *┤ 〚 .ضيف-دولارات 〛*
> *┤────────────···*  
> *┤ 〚 .الامردا 〛* 
> *┤ 〚 .الملف-دا 〛* 
> *┤ 〚 .جيب 〛* 
> *┤ 〚 .بحوث 〛* 
> *┤ 〚 .باتش-اضاف 〛* 
> *┤ 〚 .باتش-حذف 〛* 
> *┤ 〚 .باتش-عرض 〛* 
> *┤ 〚 .باتش-تعديل 〛* 
> *┤ 〚 .باتش-الكل 〛* 
> *┤ 〚 .قاعده_بيانات 〛* 
> *┤ 〚 .حفظ-الصوره 〛*  
> *┤────────────···*
> *┤ 〚 .المستخدمين 〛* 
> *┤ 〚 .الان 〛*  
> *┤ 〚 .سبام 〛* 
> *┤ 〚 .خفي 〛* 
> *┤ 〚 .حطها_بروفايل 〛* 
> *┤ 〚 .ستوري 〛* 
> *╯────────────···*
*✪┋𝐁𝐘┋❥ 𝐓𝐀𝐑𝐁𝐎𝐎☞𝐁𝐎𝐓 ┋✪*
*⟣┈┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈┈┈⟢* 
`
  conn.sendMessage(m.chat, {
           video: { url: videoUrl }, caption: str,
     mentions: [m.sender,global.conn.user.jid],
     gifPlayback: true,gifAttribution: 0
       }, { quoted: m });
   };

handler.help = ['main']
handler.tags = ['group']
handler.command = ['قائمتي']
handler.rowner = true
export default handler
